src/main/resources/cdm-sample-files/dtcc-11-0/DDL_NewTrade1.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
              xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/  ../../schemas/dtcc-11-0/soap-envelope.xsd"
              xmlns:fpml="http://www.fpml.org/2010/FpML-4-9" xmlns:rm="OTC_RM_11-0"
              xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mtc="OTC_Matching_11-0">
    <!-- New Trade Bilaterally matched and confirmed on MCP, single representation submitted to the TIW, 
        representing a single view of the trade economics for both parties along with private information (workflow fields) 
        for each party on the trade, where present and applicable. Workflow data submitted by the buyer/seller will be identified using an href attribute to the respective partyId.  <Submitter> section used in TradeMsg header, to identify designated party to the trade, alongside <ContraTradeId> to identify designated counterparty
    
    Schema mods: 
                 1. Inclusion of href on WorkflowData (to anchor to party/counterparty of the trade)-->
    <env:Header>
        <OTC_RM xmlns="OTC_RM_11-0">
            <Manifest>
                <TradeMsg>
                    <Activity>New</Activity>
                    <!-- Confirmed status -->
                    <Status>Confirmed</Status>
                    <TransType>Trade</TransType>
                    <ProductType>CreditDefaultSwapShort</ProductType>
                    <!-- DTCC: Submitter is the designated party to the trade. -->
                    <Submitter>
                        <partyTradeIdentifier>
                            <fpml:partyReference href="DTCCDEMO0321"/>
                            <fpml:tradeId tradeIdScheme="TradeRefNbr">D_0423_R1_S6_3Assgn</fpml:tradeId>
                            <!-- MCP Transaction Id added. Platform ID -->
                            <fpml:tradeId tradeIdScheme="MCPTransactionID">MCP_TRNOLD_A</fpml:tradeId>
                            <!-- Event Processing ID added -->
                            <fpml:tradeId tradeIdScheme="EventProcessingId">581067</fpml:tradeId>
                        </partyTradeIdentifier>
                    </Submitter>
                    <!-- ContraTradeId is the designated counterparty to the Trade -->
                    <ContraTradeId>
                        <partyTradeIdentifier>
                            <fpml:partyReference href="DTCCDEMO0456"/>
                            <fpml:tradeId tradeIdScheme="TradeRefNbr">D_0423_R1_S6_3Assgn</fpml:tradeId>
                            <!-- MCP Transaction Id added. Platform ID -->
                            <fpml:tradeId tradeIdScheme="MCPTransactionID">MCP_TRNOLD_A</fpml:tradeId>
                            <!-- Event Processing ID added -->
                            <fpml:tradeId tradeIdScheme="EventProcessingId">581067</fpml:tradeId>
                        </partyTradeIdentifier>
                    </ContraTradeId>
                    <USI>
                        <USIIssuer issuerIdScheme="http://www.fpml.org/coding-scheme/external/cftc/issuer-identifier">UAL001</USIIssuer>
                        <USITradeId tradeIdScheme="http://www.fpml.org/coding-scheme/external/Unique-transaction-identifier">USIA010555</USITradeId>
                    </USI>
                </TradeMsg>
                <!-- UniqueId used to track submission. This MUST be echoed back by the TIW -->
                <MsgId>MKREQ1f</MsgId>
            </Manifest>
            <Delivery>
                <RouteInfo>
                    <!-- EXTSURASUB1 identifies Markit as the submitter here -->
                    <From>DTCCDEMOSUB1</From>
                    <!-- DTCC as the receiver -->
                    <To>DTCC</To>
                </RouteInfo>
                <RouteHist>
                    <Route>
                        <RouteAddress>www.requestoraddress.com</RouteAddress>
                        <ReceiveTime>2007-10-31T18:08:40.335-05:00</ReceiveTime>
                        <ReleaseTime>2007-10-31T18:08:40.335-05:00</ReleaseTime>
                    </Route>
                </RouteHist>
            </Delivery>
        </OTC_RM>
    </env:Header>
    <env:Body>
        <!--  Start of Body  -->
        <OTC_Matching xmlns="OTC_Matching_11-0">
            <Activity>New</Activity>
            <Status>Confirmed</Status>
            <WarehouseState>
                <WarehouseStatus>Submit</WarehouseStatus>
                <WarehousePositionType>Gold</WarehousePositionType>
            </WarehouseState>
            <Trade>
                <FpML version="4-9" xmlns="http://www.fpml.org/2010/FpML-4-9"
                      xmlns:dsig="http://www.w3.org/2000/09/xmldsig#"
                      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                      xsi:schemaLocation="http://www.fpml.org/2010/FpML-4-9 ../../schemas/fpml-4-9/fpml-main-4-9.xsd
					  http://www.w3.org/2000/09/xmldsig# ../../schemas/fpml-4-9/xmldsig-core-schema.xsd"
                      xsi:type="RequestTradeConfirmation">
                    <header>
                        <!-- note: DTCC recommends the FpML messageId tag contents matches the RM:MsgId contents -->
                        <messageId messageIdScheme="perFpMLReqmt">MKREQ1f </messageId>
                        <!-- sentBy is the designated party to the trade -->
                        <sentBy>DTCCDEMO0321</sentBy>
                        <!-- sendTo is the designated counterparty to the Trade -->
                        <sendTo>DTCCDEMO0456</sendTo>
                        <creationTimestamp>2007-10-31T18:08:40.335-05:00</creationTimestamp>
                    </header>
                    <trade>
                        <tradeHeader>
                            <partyTradeIdentifier>
                                <partyReference href="DTCCDEMO0321"/>
                                <tradeId tradeIdScheme="TradeRefNbr">D_0423_R1_S6_3Assgn</tradeId>
                            </partyTradeIdentifier>
                            <!-- DTCC: on confirmed transactions, we add in the TradeId for the designated counterparty too -->
                            <partyTradeIdentifier>
                                <partyReference href="DTCCDEMO0456"/>
                                <fpml:tradeId tradeIdScheme="TradeRefNbr">D_0423_R1_S6_3Assgn</fpml:tradeId>
                            </partyTradeIdentifier>
                            <tradeDate>2017-05-30</tradeDate>
                        </tradeHeader>
                        <creditDefaultSwap>
                            <generalTerms>
                                <effectiveDate>
                                    <!-- the "Effective Date" is to be in the unadjustedDate tag.  The business day convention
									does not apply 'NotApplicable' for trades under master confirms 
										(since the master confirm convention applies.)	
										For StandardAsiaCorporate the effectiveDate must always be tradeDate+1 -->
                                    <unadjustedDate>2017-05-31</unadjustedDate>
                                    <dateAdjustments>
                                        <businessDayConvention>NotApplicable</businessDayConvention>
                                    </dateAdjustments>
                                </effectiveDate>
                                <scheduledTerminationDate>
                                    <!-- the "Scheduled Termination Date" is to be in the unadjustedDate tag.  The business day convention
										does not apply 'NotApplicable' for trades under master confirms 
										(since the master confirm convention applies.) 
										For StandardAsiaCorporate the month and day portion of the date must one of the       
                                     "03-20","06-20","09-20","12-20" -->
                                    <adjustableDate>
                                        <unadjustedDate>2022-03-20</unadjustedDate>
                                        <dateAdjustments>
                                            <businessDayConvention>NotApplicable</businessDayConvention>
                                        </dateAdjustments>
                                    </adjustableDate>
                                </scheduledTerminationDate>
                                <!-- Field name: "Floating Rate Payer ("Seller")" is the sellerPartyReference tag.  
                                      This tag will be empty.  The href attribute will be the DTCC participant number of the seller -->
                                <sellerPartyReference href="DTCCDEMO0321"/>
                                <!-- Field name:"Fixed Rate Payer ("Buyer")" is the buyerPartyReference tag.  
                                     This tag will be empty.  The href attribute will be the DTCC	participant number of the buyer -->
                                <buyerPartyReference href="DTCCDEMO0456"/>
                                <referenceInformation>
                                    <referenceEntity>
                                        <entityName entityNameScheme="http://www.fpml.org/spec/2003/entity-name-RED">PFIZED INC.</entityName>
                                        <entityId entityIdScheme="http://www.fpml.org/spec/2003/entity-id-RED">21657K</entityId>
                                    </referenceEntity>
                                    <referenceObligation>
                                        <bond>
                                            <instrumentId instrumentIdScheme="http://www.fpml.org/spec/2002/instrument-id-ISIN">US635405AQ55</instrumentId>
                                        </bond>
                                    </referenceObligation>
                                </referenceInformation>
                                <!-- Additional Terms is Optional. -->
                                <additionalTerm additionalTermScheme="http://derivserv.dtcc.com/coding-scheme/additional-term"/>
                            </generalTerms>
                            <feeLeg>
                                <!-- singlePayment represents a single fixed amount which the buyer pays to the seller ie Seller = Receiver and Buyer = Payer. This can be used in lieu of periodicPayment, or in conjunction with periodicPayment.-->
                                <singlePayment>
                                    <!-- For StandardAsiaCorporate the adjustablePaymentDate must always be tradeDate+3 -->
                                    <adjustablePaymentDate>2017-06-02</adjustablePaymentDate>
                                    <fixedAmount>
                                        <currency currencyScheme="http://www.fpml.org/ext/iso4217">USD</currency>
                                        <amount>67000</amount>
                                    </fixedAmount>
                                </singlePayment>
                                <periodicPayment>
                                    <paymentFrequency>
                                        <!-- For StandardAsiaCorporate: paymentFrequency must be "3" "M"(months)  -->
                                        <periodMultiplier>3</periodMultiplier>
                                        <period>M</period>
                                    </paymentFrequency>
                                    <!--For StandardAsiaCorporate, the firstPeriodStartDate will be Calculated based on the start of the previous roll.  This should reflect the adjusted date.-->
                                    <firstPeriodStartDate>2017-03-20</firstPeriodStartDate>
                                    <!-- For StandardAsiaCorporate the firstPaymentDate element must be included and is always the next Quarterly Date; 
										The submitted date must reflect the next Quarterly Date -->
                                    <firstPaymentDate>2017-06-20</firstPaymentDate>
                                    <rollConvention>20</rollConvention>
                                    <fixedAmountCalculation>
                                        <!-- Field name:"Fixed Rate" Per the FpML definition, the  period fixed rate is a per 
                                         annum rate, expressed as a decimal i.e. a fixed rate of 5% per year would be represented as
                                         0.0500.  For 100-500 Standard CDS must contain an equivalent of either 0.0100 or  
                                         0.0500. -->
                                        <fixedRate>0.0100</fixedRate>
                                    </fixedAmountCalculation>
                                </periodicPayment>
                            </feeLeg>
                            <protectionTerms>
                                <calculationAmount id="calculationAmount">
                                    <!-- Field name: "Calculation Amount Currency" is to be in the following currency tag. 
										The currencyScheme must be specified and must be as shown below.-->
                                    <currency currencyScheme="http://www.fpml.org/ext/iso4217">USD</currency>
                                    <amount>1000000</amount>
                                </calculationAmount>
                                <creditEvents>
                                    <!-- For StandardAsiaCorporate : restructuring is always applicable and stored as "true" -->
                                    <restructuring/>
                                </creditEvents>
                            </protectionTerms>
                        </creditDefaultSwap>
                        <calculationAgent>
                            <calculationAgentPartyReference href="DTCCDEMO0321"/>
                        </calculationAgent>
                        <!-- For StandardAsiaCorporate : calculationAgentBusinessCenter must equal "GBLO"for London  -->
                        <calculationAgentBusinessCenter businessCenterScheme="http://www.fpml.org/spec/2000/business-center">GBLO</calculationAgentBusinessCenter>
                        <collateral>
                            <independentAmount>
                                <payerPartyReference href="DTCCDEMO0321"/>
                                <receiverPartyReference href="DTCCDEMO0456"/>
                                <paymentDetail>
                                    <paymentRule xsi:type="PercentageRule">
                                        <paymentPercent>.02</paymentPercent>
                                        <notionalAmountReference href="calculationAmount"/>
                                    </paymentRule>
                                </paymentDetail>
                            </independentAmount>
                        </collateral>
                        <documentation>
                            <masterAgreement>
                                <masterAgreementType masterAgreementTypeScheme="http://dtcc.com/coding-scheme/master-agreement-type">ISDA</masterAgreementType>
                                <!-- Master Agreement Version is Optional. -->
                                <masterAgreementVersion masterAgreementVersionScheme="http://www.fpml.org/coding-scheme/master-agreement-version">2016</masterAgreementVersion>
                                <masterAgreementDate>2003-10-01</masterAgreementDate>
                            </masterAgreement>
                            <contractualDefinitions contractualDefinitionsScheme="http://www.fpml.org/coding-scheme/contractual-definitions">ISDA2014Credit</contractualDefinitions>
                            <!-- For Transaction Type of StandardAsiaCorporate, Monoline provisions is not allowed -->
                            <contractualMatrix>
                                <matrixType matrixTypeScheme="http://www.fpml.org/coding-scheme/matrix-type">CreditDerivativesPhysicalSettlementMatrix</matrixType>
                                <publicationDate>2005-03-07</publicationDate>
                                <matrixTerm matrixTermScheme="http://www.fpml.org/coding-scheme/credit-matrix-transaction-type">StandardAsiaCorporate</matrixTerm>
                            </contractualMatrix>
                        </documentation>
                    </trade>
                    <party id="DTCCDEMO0321">
                        <partyId partyIdScheme="DTCC">DTCCDEMO0321</partyId>
                    </party>
                    <party id="DTCCDEMO0456">
                        <partyId partyIdScheme="DTCC">DTCCDEMO0456</partyId>
                    </party>
                </FpML>
            </Trade>
            <!-- DTCC: Inclusion of href on WorkflowData. Mod to existing schema -->
            <!-- WorkflowData sections per Party. Party identified by href -->
            <WorkflowData>
                <partyReference href="DTCCDEMO0321"/>
                <!-- These are the designated party workflow fields -->
                <PartyWorkflowFields>
                    <comment>New DTCCDEMO0321 Trade for XXX notional</comment>
                    <superId>ABC_PrechangedValue 1</superId>
                    <deskId>DeskId 1</deskId>
                    <eTradeId>DerivServ10_54</eTradeId>
                    <designatedParty>ABC Clearing 1</designatedParty>
                    <brokerName>BrokerName 1</brokerName>
                    <branchLocation>water street 1</branchLocation>
                </PartyWorkflowFields>
                <!-- DTCC: We won't populate ContraWorkflowfields, as these are catered for in the explicit
                    WorkflowData section for the designated Counterparty. -->
                <!--<ContraWorkflowFields/>-->
            </WorkflowData>
            <!-- WorkflowData sections per Party. Party identified by href-->
            <WorkflowData>
                <partyReference href="DTCCDEMO0456"/>
                <!-- These are the designated party workflow fields -->
                <PartyWorkflowFields>
                    <comment>New DTCCDEMO0456 Trade for XXX notional</comment>
                    <superId>ABC_PrechangedValue 2</superId>
                    <deskId>DeskId 2</deskId>
                    <eTradeId>DerivServ10_55</eTradeId>
                    <designatedParty>ABC Clearing 2</designatedParty>
                    <brokerName>BrokerName 2</brokerName>
                    <branchLocation>water street 2</branchLocation>
                </PartyWorkflowFields>
                <!-- DTCC: We won't populate ContraWorkflowfields, as these are catered for in the explicit
                    WorkflowData section for the designated Party -->
                <!--<ContraWorkflowFields/>-->
            </WorkflowData>
        </OTC_Matching>
    </env:Body>
</env:Envelope>
